IDENTIFICATION DIVISION.
PROGRAM-ID. Program8.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STRING1 PIC X(20) VALUE 'COBOL Programming '.
01 WS-STRING2 PIC X(10) VALUE 'is fun!' .

01 WS-RESULT-STRING PIC X(30) VALUE SPACES.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    STRING WS-STRING1
        WS-STRING2
    DELIMITED BY SIZE
    INTO WS-RESULT-STRING.

    DISPLAY WS-RESULT-STRING.
    STOP RUN.

