IDENTIFICATION DIVISION.
PROGRAM-ID. Program3.

DATA DIVISION.
FILE SECTION.
FD INFILE.
01 IN-RECORD.
   02 IN-DATA PIC X(60).

SD OUTFILE.
01 OUT-RECORD.
   02 OUT-DATA PIC X(60).

WORKING-STORAGE SECTION.
01 FILE-STATUS PIC XX.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    OPEN INPUT INFILE
        OUTPUT OUTFILE.

    READ INFILE AT END MOVE 'EOF' TO FILE-STATUS.
    PERFORM UNTIL FILE-STATUS = 'EOF'
        WRITE OUT-RECORD FROM IN-RECORD
            AFTER ADVANCING 1 LINE
        READ INFILE AT END MOVE 'EOF' TO FILE-STATUS
    END-PERFORM.

    CLOSE INFILE
          OUTFILE.

    STOP RUN.

