IDENTIFICATION DIVISION.
PROGRAM-ID. Program1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DATA PIC X(20).

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    DISPLAY "Enter data: ".
    ACCEPT WS-DATA.
    DISPLAY "You entered: " WS-DATA.

    STOP RUN.

