IDENTIFICATION DIVISION.
PROGRAM-ID. Program4.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM PIC S9(3) COMP VALUE 0.
01 WS-I   PIC 9(3)  COMP VALUE 0.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    PERFORM UNTIL WS-I > 10
        ADD 1 TO WS-I
        IF WS-I > 5 THEN
            SUBTRACT 1 FROM WS-I
            MULTIPLY WS-NUM BY WS-I GIVING WS-NUM
        ELSE
            ADD WS-I TO WS-NUM
        END-IF
        DISPLAY "WS-NUM:" WS-NUM
    END-PERFORM. 

    STOP RUN.

