IDENTIFICATION DIVISION.
PROGRAM-ID. Program5.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TABLE.
   03 WS-TABLE-ITEM PIC 9(3) OCCURS 5.

01 WS-I        PIC 9(3) COMP.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        MOVE WS-I TO WS-TABLE-ITEM (WS-I)
    END-PERFORM.

    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        DISPLAY "WS-TABLE-ITEM (",WS-I,"): " WS-TABLE-ITEM (WS-I)
    END-PERFORM.
    
    STOP RUN.

