IDENTIFICATION DIVISION.
PROGRAM-ID. Program2.

DATA DIVISION.
WORKING-STORAGE SECTION.  
01 WS-NUM1 PIC 9(2).
01 WS-NUM2 PIC 9(2).
01 WS-RESULT PIC 9(3).

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    DISPLAY "Enter first number: ".
    ACCEPT WS-NUM1.
    DISPLAY "Enter second number: ".
    ACCEPT WS-NUM2.

    COMPUTE WS-RESULT = WS-NUM1 + WS-NUM2.
    DISPLAY "Sum: " WS-RESULT.

    STOP RUN.

